src/cf/База2/Documents/ПеремещениеСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеремещениеСоСклада</Name>
			<BasedOn>
				<xr:Item>Document.ПотребностьВТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПотребностьВТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/База2/AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/База2/Documents/ПеремещениеСоСклада/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = ЛОЖЬ;
	Движения.ОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл  
		Отказ = ЕстьНаСкладе(ТекСтрокаСписокТМЦ.Номенклатура,ТекСтрокаСписокТМЦ.Количество, СкладОтправитель); 
		Если Отказ Тогда
			Сообщить("Не хватает остатка по " + ТекСтрокаСписокТМЦ.Номенклатура);
		КонецЕсли;
		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокТМЦ.Номенклатура;
		Движение.Склад = СкладОтправитель;
		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	КонецЦикла;

	Движения.ОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
		Движение = Движения.ОстаткиНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСписокТМЦ.Номенклатура;
		Движение.Склад = СкладПолучатель;
		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	КонецЦикла;

КонецПроцедуры

Функция ЕстьНаСкладе(Номенклатура, КолВо, Склад)
	Запрос = Новый ЗАпрос;
	ЗАпрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
	|	ОстаткиНаСкладеОстатки.Склад КАК Склад,
	|	ОстаткиНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиНаСкладе.Остатки(&Дата, ) КАК ОстаткиНаСкладеОстатки
	|ГДЕ
	|	ОстаткиНаСкладеОстатки.Номенклатура = &Номенклатура
	|	И ОстаткиНаСкладеОстатки.Склад = &Склад
	|	И ОстаткиНаСкладеОстатки.КоличествоОстаток >= &Количество";
	Запрос.УстановитьПараметр("Дата", текущаяДата());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Количество",КолВо);
	Результат = Запрос.Выполнить().Выбрать();
	Возврат НЕ Результат.Следующий();
КонецФункции
